/******************************************************************************

                   Usart设备硬件定义及相关配置模块
//此模块定义UsartHw设备,同时辅助UsartDev完成对LPC_Arm相关芯片Usart的配置
******************************************************************************/
#ifndef __USART_HW_LPC_ARM_H
#define __USART_HW_LPC_ARM_H

/******************************************************************************
                         相关配置
******************************************************************************/



/******************************************************************************
                  Usart设备配置
******************************************************************************/
#include "UsartDevCfg.h"
#include "LPC12XX.h"

//---------------------------------配置函数---------------------------------
//使用Usart推荐的配置结构,返回是否成功
//注：此函数不负责配置除Uart硬件外的其它部分，如引脚，中断，时钟等
signed char UsartHw_Cfg(struct _USART_HW *pUartHw,//需配置的硬件
                        const struct _UsartDevCfg *pCfg);

/******************************************************************************
                        底层实现相关回调函数
//此回调函数根据底层实现不同可能有区别
******************************************************************************/

//--------------------------得到系统主时钟函数-----------------------------
//unsigned long UsartHw_cbGetMck(void);
#define UsartHw_cbGetMck() (SystemCoreClock)

#endif

