/*******************************************************************************

                     ComCount结构菜单实现
此菜单数据为只读
*******************************************************************************/
#ifndef _USART_DEV_CFG_TMENU_H
#define _USART_DEV_CFG_TMENU_H

#include "UsartDevCfg.h"
#include "TMenu.h"

/*******************************************************************************
                                       菜单结构
*******************************************************************************/

//-----------------------------通讯参数结构--------------------------------
extern const TMenu_t UsartDevCfg_TMenu; 

//------------------------用户工作模式的菜单结构---------------------------
extern const TMenu_t UsartDevCfgU0_TMenu;

/*******************************************************************************
                             回调函数
*******************************************************************************/

//--------------------------得到当前调整结构Id--------------------------------
unsigned char UsartDevCfgTMenu_cbGetId(void); 

//----------------------------自已的父菜单----------------------------------
#ifndef USART_DEV_CFG_TMENU_PARENT
  extern  TMenu_t Menu_Buf; //可能有多个派生类，用RAM实现
  #define USART_DEV_CFG_TMENU_PARENT  &Menu_Buf
#endif

#endif //_DI_DEV_TMENU_H


